export const searchImage = () => {
  return `<div id="searchImage">
            <img src="../assets/search-item.gif" alt="search-image">
        </div>`;
};

/* Этот модуль экспортирует функцию searchImage, которая возвращает HTML-код в виде строки. 
Этот код создает элемент div с идентификатором searchImage, который содержит изображение, заданное с помощью тега <img>. 
Путь к изображению указан относительно корневого каталога (../assets/search-item.gif).
Эта функция, используется для отображения анимированного изображения, которое сигнализирует о том, что происходит поиск. */
